[
  {
    "name": "Hardy Banana Plant (Musa basjoo)",
    "link": "https://www.logees.com/hardy-banana-musa-basjoo.html",
    "description": "Imagine growing tropical bananas in your outdoor garden as far north as New England. With this Hardy Banana you’ll get a defining tropical look. And, yes with proper mulching, it can withstand temperatures below zero. This extremely vigorous banana grows many feet in a season and in time forms large clumps that can reach up to 13' in height. Also known as the Japanese Fiber Banana, it makes a fine container specimen. If grown inside, it will tolerate varying conditions of temperature and light with ease. Although it does produce bananas, they are inedible. Simple to grow, give it plenty of water, fertilizer and sunlight.",
    "price": "$24.95"
  },
  {
    "name": "Beach Plum Tree",
    "link": "https://www.mehrabyannursery.com/shop/plum-trees/beach-plum-tree/",
    "description": "The Beach Plum (*Prunus maritima*), native to coastal areas from Virginia to Nova Scotia, is prized for its fruit used in jams and jellies, and achieves optimal growth when planted in groups to facilitate cross-pollination. Facing threats from pests like plum gougers and plum curculio, as well as brown rot, this plum requires consistent fungicide treatments but remains a valuable and ornamental addition to coastal gardens with its vivid seasonal displays.",
    "price": "$10.50"
  },
  {
    "name": "Jersey Beach Plum",
    "link": "https://raintreenursery.com/products/jersey-beach-plum-st-julian-a",
    "description": "*Prunus maritima* 'Jersey'\n\nEnjoy plums on the beach! Jersey beach plum is a grafted American variety that produces tasty red plums when pollinized by another beach plum, such as Premier. Tolerant of salty spray, it prefers sandy soil and offers us a delicious plum that tastes of strawberry, plum, and apricot. Beach plums bloom in early spring and ripen in August, though due to the variable nature of beach soils height and crop density may vary. Not recommended for the relatively cool and short summers of the Pacific Northwest, these plums do fantastically well in the Northeastern climate of the United States.",
    "price": "$64.99"
  },
  {
    "name": "Moringa Seeds",
    "link": "https://trueleafmarket.com/products/moringa-seeds",
    "description": "160-170 Days to maturity. *Moringa oleifera*. Moringa Seeds. Non-GMO, Perennial, Deciduous Softwood Tree. Moringa is also known as the Drumstick Tree, Horseradish Tree, and Ben Oil Tree. It is enjoyed in the landscape for its fragrant white raceme blooms in the spring as a specimen planting, or a tall hedge. Because of its medicinal use, Moringa has also been labeled a 'miracle tree' having antifungal, antiviral, antidepressant, and anti-inflammatory properties. Readily propagates from cuttings, or from seed for beautiful heat (up to 118°F in shade), and drought-tolerant tropical plants. All parts of the Moringa tree are edible, from leaves to roots, including pods, bark, nuts, etc... Approx 85 seeds/oz.",
    "price": "$4.59"
  }
]
